sample_data/test_files_synthetic/small/soap/soap_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:calc="http://tempuri.org/">
  <soap:Header>
    <auth:Authentication xmlns:auth="http://example.com/auth">
      <auth:Username>john.doe</auth:Username>
      <auth:Password>secret123</auth:Password>
    </auth:Authentication>
    <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">
      http://tempuri.org/ICalculator/Add
    </wsa:Action>
    <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">
      urn:uuid:12345678-1234-1234-1234-123456789012
    </wsa:MessageID>
  </soap:Header>
  <soap:Body>
    <calc:Add>
      <calc:intA>10</calc:intA>
      <calc:intB>5</calc:intB>
    </calc:Add>
  </soap:Body>
</soap:Envelope>